gRPC로 스팩 정리
